This script is used to clean the data of the times df and prepare it for the 6.6 assignment. The final product of this script is a clean and uniform times ranking data frame.

In [1]:
import pandas as pd
import numpy as np
import os
import pycountry_convert as pc

In [2]:
path = r'C:\Users\justi\University Scores'

In [3]:
df = pd.read_csv(os.path.join(path, 'Original Data', 'World University Rankings', 'timesData.csv'), index_col = False)

In [4]:
df.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,-,94.2,"7,929",8.4,27%,45 : 55,2011

Rename Columns Appropriately to correlate with main data set

In [5]:
df.rename(columns = {'university_name' : 'institution'}, inplace = True)
df.rename(columns = {'world_rank' : 'times_world_rank'}, inplace = True)
df.rename(columns = {'international_students' : 'percentage_international_students'}, inplace = True)
df.rename(columns = {'total_score' : 'times_score'}, inplace = True)

Removing duplicates

In [6]:
dfsubset = df[df.duplicated()]
dfsubset

Empty DataFrame
Columns: [times_world_rank, institution, country, teaching, international, research, citations, income, times_score, num_students, student_staff_ratio, percentage_international_students, female_male_ratio, year]
Index: []

Identifying Types of data

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2603 entries, 0 to 2602
Data columns (total 14 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   times_world_rank                   2603 non-null   object
 1   institution                        2603 non-null   object
 2   country                            2603 non-null   object
 3   teaching                           2603 non-null   float64
 4   international                      2603 non-null   object
 5   research                           2603 non-null   float64
 6   citations                          2603 non-null   float64
 7   income                             2603 non-null   object
 8   times_score                        2603 non-null   object
 9   num_students                       2544 non-null   object
 10  student_staff_ratio                2544 non-null   float64
 11  percentage_international_students  2536 non-null   object
 12  female_male_ratio                  2370 non-null   object
 13  year                               2603 non-null   int64
dtypes: float64(4), int64(1), object(9)
memory usage: 284.8+ KB

Making variable num_students uniform variable type

In [8]:
df['num_students'] = df['num_students'].astype('object')

In [9]:
df['num_students'] = df['num_students'].replace(',','', regex=True)

In [10]:
df['num_students'] = df['num_students'].astype('float64')

Making variable times_world_rank a float

In [11]:
df = df.replace(str('201-225'), '201')
df = df.replace(str('201-250'), '201')
df = df.replace(str('226-250'), '226')
df = df.replace(str('251-275'), '251')
df = df.replace(str('251-300'), '251')
df = df.replace(str('276-300'), '276')
df = df.replace(str('301-350'), '301')
df = df.replace(str('351-400'), '351')
df = df.replace(str('350-400'), '351')
df = df.replace(str('401-500'), '401')
df = df.replace(str('501-600'), '501')
df = df.replace(str('601-800'), '601')
df['times_world_rank'] = df['times_world_rank'].replace('=','', regex=True)

In [12]:
df['times_world_rank'] = df['times_world_rank'].astype('float64')

Make times_score a float

In [13]:
df['times_score'] = df['times_score'].replace('-', None)

In [14]:
df['times_score'].value_counts()

49.0    13
51.1    12
46.6    11
56.1    10
51.2    10
        ..
63.8     1
87.3     1
90.2     1
90.7     1
96.1     1
Name: times_score, Length: 414, dtype: int64

In [15]:
df['times_score'] = df['times_score'].astype('float64')

Change Country names to match main document

In [16]:
pd.options.display.max_columns = None
pd.options.display.max_rows = None

In [17]:
df['country'].value_counts()

United States of America     659
United Kingdom               300
Germany                      152
Australia                    117
Canada                       108
Japan                         98
Italy                         94
China                         83
Netherlands                   75
France                        73
Taiwan                        57
Spain                         57
South Korea                   57
Sweden                        57
Switzerland                   47
Belgium                       37
Hong Kong                     34
Turkey                        33
Finland                       32
Republic of Ireland           31
Austria                       31
New Zealand                   30
India                         30
Denmark                       29
Brazil                        25
Norway                        21
Russian Federation            20
South Africa                  20
Israel                        19
Portugal                      18
Czech Republic                13
Poland                        13
Iran                          13
Singapore                     12
Greece                        11
Thailand                      11
Chile                          8
Hungary                        6
Saudi Arabia                   6
Estonia                        5
Iceland                        5
Colombia                       5
Egypt                          5
Malaysia                       5
Romania                        4
Mexico                         3
Slovakia                       2
Jordan                         2
United Arab Emirates           2
Pakistan                       2
Slovenia                       2
Ukraine                        2
Morocco                        2
Macau                          2
Kenya                          1
Argentina                      1
Qatar                          1
Oman                           1
Nigeria                        1
Latvia                         1
Indonesia                      1
Lebanon                        1
Ghana                          1
Bangladesh                     1
Serbia                         1
Belarus                        1
Uganda                         1
Unted Kingdom                  1
Cyprus                         1
Unisted States of America      1
Luxembourg                     1
Lithuania                      1
Name: country, dtype: int64

In [18]:
df['country'] = df['country'].replace('Unisted States of America','United States of America', regex=True)

In [19]:
df['country'] = df['country'].replace('Republic of Ireland','Ireland', regex=True)

In [20]:
df['country'] = df['country'].replace('Unted Kingdom','United Kingdom', regex=True)

In [21]:
df['country'] = df['country'].replace('Russian Federation','Russia', regex=True)

In [22]:
df['country'] = df['country'].replace('Hong Kong','China', regex=True)

In [23]:
df['country'] = df['country'].replace('Taiwan','China', regex=True)

add flags

In [24]:
df.loc[df['times_world_rank'] <=100, 'times_rank_flag_top_x'] = '100'
df.loc[(df['times_world_rank'] > 100) & (df['times_world_rank'] <= 200), 'times_rank_flag_top_x'] = '200'
df.loc[(df['times_world_rank'] > 200) & (df['times_world_rank'] <= 300), 'times_rank_flag_top_x'] = '300'
df.loc[(df['times_world_rank'] > 300) & (df['times_world_rank'] <= 400), 'times_rank_flag_top_x'] = '400'
df.loc[df['times_world_rank'] > 400, 'times_rank_flag_top_x'] = '1000'

In [25]:
df['times_rank_flag_top_x'] = df['times_rank_flag_top_x'].astype('float64')

Create a continent column

In [26]:
f = lambda x: pc.country_name_to_country_alpha2(x, cn_name_format = 'default')
df['country_code'] = df['country'].apply(f)

In [27]:
f2 = lambda x: pc.country_alpha2_to_continent_code(x)
df['continent_code'] = df['country_code'].apply(f2)

In [28]:
df['continent_code'].value_counts()

EU    1143
NA     771
AS     472
OC     147
SA      39
AF      31
Name: continent_code, dtype: int64

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2603 entries, 0 to 2602
Data columns (total 17 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   times_world_rank                   2603 non-null   float64
 1   institution                        2603 non-null   object
 2   country                            2603 non-null   object
 3   teaching                           2603 non-null   float64
 4   international                      2603 non-null   object
 5   research                           2603 non-null   float64
 6   citations                          2603 non-null   float64
 7   income                             2603 non-null   object
 8   times_score                        1201 non-null   float64
 9   num_students                       2544 non-null   float64
 10  student_staff_ratio                2544 non-null   float64
 11  percentage_international_students  2536 non-null   object
 12  female_male_ratio                  2370 non-null   object
 13  year                               2603 non-null   int64
 14  times_rank_flag_top_x              2603 non-null   float64
 15  country_code                       2603 non-null   object
 16  continent_code                     2603 non-null   object
dtypes: float64(8), int64(1), object(8)
memory usage: 345.8+ KB

Export File

In [30]:
df.to_pickle(os.path.join(path, 'Prepared Data', 'times_df_cleaned.pkl'))

In [31]:
df.to_csv(os.path.join(path, 'Prepared Data', 'times_df_cleaned_csv.csv'))